#include <stdio.h>
#include <iostream>
#include <windows.h>

//////////////////////////////////////////////////////////////////////////////////////////////////
// ↓　関数群
//////////////////////////////////////////////////////////////////////////////////////////////////

typedef void (*FunctionPtr)(int*);

void Wait(int* s) {
	printf("%d秒待ちました\n", *s);
}

void SetTimeout(FunctionPtr ptr, int second) {
	Sleep(second * 1000);
	ptr(&second);
}

//////////////////////////////////////////////////////////////////////////////////////////////////
// ↓　main
//////////////////////////////////////////////////////////////////////////////////////////////////

int main() {
	srand((unsigned int)time(nullptr));
	
	int input = 0;
	printf("偶数か奇数を選んでください(偶数 : 0, 奇数 : 1)\n");
	std::cin >> input;

	// 入力された値の確認を行う -------------------------------------------
	[&]() {
	while (input != 0 && input != 1) {
		printf("0か1かを選んでください\n");
		std::cin >> input;
	}
		}();

	// 関数ポインタを設定 ------------------------------------------------
	FunctionPtr ptr;
	ptr = Wait;
	// 実行(関数のポインタを引数に渡す)
	SetTimeout(ptr, 3);
	
	// 結果の表示 -------------------------------------------------------
	int random = (rand() % 6) + 1;
	printf("出た目は%d\n", random);
	if (input % 2 == random % 2) {
		printf("正解");
	} else {
		printf("不正解");
	}

	return 0;
}